// ignore_for_file: file_names
///План 1 лекции
///1) Жизнь и развитие Дарт и Флаттер
///2) Абстрактный Флаттер
///3) Прикладной Флаттер
///4) Виджеты
///5) Чеклист нового приложения
///
///1) Дарт - С подобный язык
///Open source в Гитхаб
///Декларативный UI
///Единая кодовая база приложений
///Гугл пэй написан на флаттере
///Rive - редактор анимаций
///Яндекс про - исполнители:таксисты, курьеры
///
///Абстрактный флаттер
///Всё есть виджет
///Skia - графический движок для отрисовки UI
///
///Различия императивного и декларативного стиля UI
///Императивный - отвечает на вопрос Как отрисовать?
///Декларативный - отвечает на вопрос Что?   State(состояние) через функцию
///транслируется во View
///
///Архитектура
///Embedder на соответствующих языках
///Далее Engine на C++ (Isolate, Rendering)
///Framework на Dart
///Сам Application
///
///CMD комманды
///framework - doctor, upgrade, downgrade
///проект - create, pub get, pub upgrade
///код - format, analyze, test
///сборка - run, build, clean
///
///Структура проекта
///lib - весь исходный код
///pubspec.yaml - конфигурация проекта
///android, ios и тп - платформенный код для каждой платформы
///analysis_options - правила статического анализатора
///
///Material App - тема, навигация и интернализаций
///
///Scaffold - весь лэйаут нашего материального приложения
///
///alt + enter (посмотреть на вс код в настройках) для обертки (wrap) виджета
///
